In [1]:
import pandas as pd

In [2]:
data_FamilyMembers = {
    'member_id': [1, 2, 3, 4, 5, 6, 7, 8],
    'status': ['father', 'mother', 'son', 'daughter', 'daughter', 'father', 'mother', 'daughter'],
    'member_name': ['Headley Quincey', 'Flavia Quincey', 'Andie Quincey', 'Lela Quincey', 
                   'Annie Quincey', 'Ernest Forrest', 'Constance Forrest', 'Wednesday Addams'],
    'birthday': ['1960-05-13T00:00:00.000Z', '1963-02-16T00:00:00.000Z', '1983-06-05T00:00:00.000Z',
                '1985-06-07T00:00:00.000Z', '1988-04-10T00:00:00.000Z', '1961-09-11T00:00:00.000Z',
                '1968-09-06T00:00:00.000Z', '2005-01-13T00:00:00.000Z']
}
data_Goods = {
    'good_id': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18],
    'good_name': ['apartment fee', 'phone fee', 'bread', 'milk', 'red caviar', 'cinema', 
                 'black caviar', 'cough tablets', 'potato', 'pineapples', 'television', 
                 'vacuum cleaner', 'jacket', 'fur coat', 'music school fee', 
                 'english school fee', 'airsoft game session', 'netflix subscription'],
    'type': [1, 1, 2, 2, 3, 4, 3, 5, 2, 3, 8, 8, 7, 7, 6, 6, 4, 4]
}
data_GoodTypes = {
    'good_type_id': [1, 2, 3, 4, 5, 6, 7, 8],
    'good_type_name': ['communal payments', 'food', 'delicacies', 'entertainment', 
                      'treatment', 'education', 'clothes', 'equipment']
}
data_Payments = {
    'payment_id': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28],
    'date': ['2005-02-12T00:00:00.000Z', '2005-03-23T00:00:00.000Z', '2005-05-14T00:00:00.000Z', '2005-07-22T00:00:00.000Z', 
            '2005-07-26T00:00:00.000Z', '2005-02-20T00:00:00.000Z', '2005-07-30T00:00:00.000Z', '2005-09-12T00:00:00.000Z',
            '2005-09-30T00:00:00.000Z', '2005-10-27T00:00:00.000Z', '2005-11-28T00:00:00.000Z', '2005-12-22T00:00:00.000Z',
            '2005-08-11T00:00:00.000Z', '2005-10-23T00:00:00.000Z', '2005-02-03T00:00:00.000Z', '2005-03-11T00:00:00.000Z',
            '2005-03-18T00:00:00.000Z', '2005-04-20T00:00:00.000Z', '2005-05-13T00:00:00.000Z', '2005-06-11T00:00:00.000Z',
            '2006-01-12T00:00:00.000Z', '2006-03-12T00:00:00.000Z', '2005-06-05T00:00:00.000Z', '2005-06-20T00:00:00.000Z',
            '2005-06-21T00:00:00.000Z', '2005-06-22T00:00:00.000Z', '2005-06-22T00:00:00.000Z', '2006-01-15T00:00:00.000Z'],
    'family_member': [1, 2, 3, 4, 4, 5, 2, 2, 5, 5, 5, 5, 3, 2, 1, 1, 2, 1, 1, 2, 3, 1, 1, 3, 2, 5, 3, 1],
    'good': [1, 1, 4, 5, 7, 6, 6, 16, 15, 15, 15, 15, 13, 14, 9, 9, 9, 9, 9, 9, 10, 5, 8, 6, 9, 18, 17, 11],
    'amount': [1, 1, 5, 1, 2, 1, 1, 1, 1, 1, 1, 1, 1, 1, 5, 5, 3, 8, 5, 3, 1, 3, 1, 8, 3, 1, 1, 1],
    'unit_price': [2000, 2100, 20, 350, 150, 100, 120, 5500, 230, 230, 250, 250, 2200, 66000, 8, 7, 8, 8, 7, 150, 100, 10, 300, 150, 150, 16, 59, 10000]
}
FamilyMembers = pd.DataFrame(data_FamilyMembers)
Goods = pd.DataFrame(data_Goods)
GoodTypes = pd.DataFrame(data_GoodTypes)
Payments = pd.DataFrame(data_Payments)

Payments['date'] = pd.to_datetime(Payments['date'])
FamilyMembers['birthday'] = pd.to_datetime(FamilyMembers['birthday'])

In [12]:
delete_member_quince = FamilyMembers.copy()
delete_member_quince = delete_member_quince[~delete_member_quince['member_name'].str.contains('Quincey')]
delete_member_quince

   member_id    status        member_name                  birthday
5          6    father     Ernest Forrest 1961-09-11 00:00:00+00:00
6          7    mother  Constance Forrest 1968-09-06 00:00:00+00:00
7          8  daughter   Wednesday Addams 2005-01-13 00:00:00+00:00

In [11]:
rename_name = FamilyMembers.copy()
rename_name.loc[rename_name['member_name']=='Andie Quincey', 'member_name'] = 'Andie Anthony'
rename_name

   member_id    status        member_name                  birthday
0          1    father    Headley Quincey 1960-05-13 00:00:00+00:00
1          2    mother     Flavia Quincey 1963-02-16 00:00:00+00:00
2          3       son      Andie Anthony 1983-06-05 00:00:00+00:00
3          4  daughter       Lela Quincey 1985-06-07 00:00:00+00:00
4          5  daughter      Annie Quincey 1988-04-10 00:00:00+00:00
5          6    father     Ernest Forrest 1961-09-11 00:00:00+00:00
6          7    mother  Constance Forrest 1968-09-06 00:00:00+00:00
7          8  daughter   Wednesday Addams 2005-01-13 00:00:00+00:00

In [10]:
Goods_for_new_string = Goods.copy()
Goods_for_new_string.loc[len(Goods_for_new_string)] = [len(Goods_for_new_string)+1, 'Cheese', GoodTypes.loc[GoodTypes['good_type_name']=='food', 'good_type_id'].values[0]]
Goods_for_new_string.tail()

    good_id             good_name  type
14       15      music school fee     6
15       16    english school fee     6
16       17  airsoft game session     4
17       18  netflix subscription     4
18       19                Cheese     2

In [19]:
avg_price_caviar = Payments.merge(Goods[Goods['good_name'].str.contains('caviar')], left_on='good', right_on='good_id')['unit_price'].mean()
avg_price_caviar = pd.DataFrame({'cost':[avg_price_caviar]})
avg_price_caviar

    cost
0  170.0

In [12]:
import datetime as dt
import numpy as np
avg_age = np.floor((dt.datetime.now()-FamilyMembers.copy()['birthday'].dt.tz_localize(None)).dt.days.mean()/365)
avg_age = int(avg_age)
avg_age

48

In [13]:
family_names_like_quince = FamilyMembers.copy()[FamilyMembers['member_name'].str.contains('Quincey')]
family_names_like_quince

   member_id    status      member_name                  birthday
0          1    father  Headley Quincey 1960-05-13 00:00:00+00:00
1          2    mother   Flavia Quincey 1963-02-16 00:00:00+00:00
2          3       son    Andie Quincey 1983-06-05 00:00:00+00:00
3          4  daughter     Lela Quincey 1985-06-07 00:00:00+00:00
4          5  daughter    Annie Quincey 1988-04-10 00:00:00+00:00

In [12]:
good_type_2005 = GoodTypes.merge(Goods, how='left', left_on='good_type_id', right_on='type').merge(Payments[Payments['date'].dt.year == 2005], how='left', left_on='good_id', right_on='good')
good_type_2005 = good_type_2005.groupby('good_type_name').apply(
    lambda x: (x['amount']*x['unit_price']).sum()
).reset_index(name='costs').sort_values('costs', ascending=False).reset_index(drop=True)
good_type_2005

C:\Temp\ipykernel_2468\2799648951.py:2: FutureWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  good_type_2005 = good_type_2005.groupby('good_type_name').apply(

      good_type_name    costs
0            clothes  68200.0
1          education   6460.0
2  communal payments   4100.0
3      entertainment   1495.0
4               food   1198.0
5         delicacies    650.0
6          treatment    300.0
7          equipment      0.0

In [22]:
not_payed_good_type_in_2005 = GoodTypes.merge(Goods, how='left', left_on='good_type_id', right_on='type').merge(Payments[Payments['date'].dt.year == 2005], how='left', left_on='good_id', right_on='good')
not_payed_good_type_in_2005 = not_payed_good_type_in_2005.groupby('good_type_name').filter(lambda x: x['payment_id'].isnull().all())[['good_type_name']].drop_duplicates().reset_index(drop=True)
not_payed_good_type_in_2005

  good_type_name
0      equipment

In [34]:
costs_in_june_2005 = Payments[(Payments['date'].dt.year == 2005)&(Payments['date'].dt.month == 6)].merge(FamilyMembers, how='right', left_on='family_member', right_on='member_id')
costs_in_june_2005['costs'] = costs_in_june_2005['amount']*costs_in_june_2005['unit_price']
costs_in_june_2005 = costs_in_june_2005.groupby('member_name')['costs'].sum()
costs_in_june_2005 = pd.DataFrame(costs_in_june_2005)
costs_in_june_2005.sort_values(by='costs', ascending=False).reset_index()

         member_name   costs
0      Andie Quincey  1259.0
1     Flavia Quincey   900.0
2    Headley Quincey   300.0
3      Annie Quincey    16.0
4     Ernest Forrest     0.0
5  Constance Forrest     0.0
6       Lela Quincey     0.0
7   Wednesday Addams     0.0

In [27]:
most_expensive_delicacies = Payments.merge(Goods, left_on='good', right_on='good_id').merge(GoodTypes, left_on='type', right_on='good_type_id')
most_expensive_delicacies = most_expensive_delicacies[most_expensive_delicacies['good_type_name']=='delicacies']
most_expensive_delicacies = most_expensive_delicacies[most_expensive_delicacies['unit_price']==(most_expensive_delicacies['unit_price'].max())][['good_name', 'unit_price']]
most_expensive_delicacies

    good_name  unit_price
3  red caviar         350

In [4]:
status_mother = FamilyMembers[FamilyMembers['status'] == 'mother'][['member_name']].reset_index(drop=True)
status_mother

         member_name
0     Flavia Quincey
1  Constance Forrest

In [9]:
count_goods_more_one = Payments.merge(Goods, left_on='good', right_on='good_id')[['good_name']]
count_goods_more_one = count_goods_more_one.groupby('good_name').size().reset_index(name='count')
count_goods_more_one = pd.DataFrame(count_goods_more_one)[count_goods_more_one['count'] > 1]
count_goods_more_one.sort_values(by='count', ascending=False)

           good_name  count
12            potato      7
9   music school fee      4
3             cinema      3
1      apartment fee      2
13        red caviar      2

In [23]:
payments_2005_each = Payments.merge(FamilyMembers, left_on='family_member', right_on='member_id')
payments_2005_each['costs'] = payments_2005_each['amount']*payments_2005_each['unit_price']
payments_2005_each = payments_2005_each[payments_2005_each['date'].dt.year == 2005]
payments_2005_each = payments_2005_each[['member_id', 'status', 'costs']].groupby(['member_id', 'status']).sum()
payments_2005_each.sort_values(by='costs', ascending=False)

                    costs
member_id status
2         mother    74644
3         son        3559
1         father     2474
5         daughter   1076
4         daughter    650

In [30]:
oldest = FamilyMembers.copy()
oldest = oldest[oldest['birthday'] == oldest['birthday'].min()][['member_name']]
oldest

       member_name
0  Headley Quincey

In [35]:
buy_potato = FamilyMembers.merge(Payments, left_on='member_id', right_on='family_member').merge(Goods, left_on='good', right_on='good_id')[['status', 'good_name']]
buy_potato = buy_potato[buy_potato['good_name'] == 'potato'][['status']].drop_duplicates()
buy_potato

    status
1   father
12  mother

In [17]:
costs_for_entertainment = Payments.merge(FamilyMembers, left_on='family_member', right_on='member_id').merge(Goods, left_on='good', right_on='good_id').merge(GoodTypes, left_on='type', right_on='good_type_id')
costs_for_entertainment = costs_for_entertainment[costs_for_entertainment['good_type_name'] == 'entertainment'][['status', 'member_name', 'amount', 'unit_price']]
costs_for_entertainment = costs_for_entertainment.groupby(['status', 'member_name']).apply(lambda x: (x['amount']*x['unit_price']).sum()).reset_index(name='costs')
costs_for_entertainment.sort_values(by='costs', ascending=False)

C:\Temp\ipykernel_7448\3626057737.py:3: FutureWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  costs_for_entertainment = costs_for_entertainment.groupby(['status', 'member_name']).apply(lambda x: (x['amount']*x['unit_price']).sum()).reset_index(name='costs')

     status     member_name  costs
2       son   Andie Quincey   1259
1    mother  Flavia Quincey    120
0  daughter   Annie Quincey    116

In [ ]:
not_payed_in_2005 = Goods.merge(Payments[Payments['date'].dt.year == 2005], how='left', left_on='good_id', right_on='good')
not_payed_in_2005 = not_payed_in_2005[not_payed_in_2005['payment_id'].isnull()][['good_name']].reset_index(drop=True)
not_payed_in_2005

        good_name
0       phone fee
1           bread
2      pineapples
3      television
4  vacuum cleaner